//Задание: Заполните пропуски в программе на Kotlin, используя абстрактные классы.
//У вас есть базовый абстрактный класс `Shape`, который представляет геометрическую фигуру.
// У этого класса есть абстрактный метод `calculateArea()`, который должен быть реализован в подклассах.

//// Заполните пропуски в этом коде, используя абстрактные классы
//// Базовый абстрактный класc Shape
//abstract class Shape {
//    // Абстрактный метод для вычисления площади фигуры
//    abstract fun calculateArea(): Double
//}
//// Подкласс Circle, представляющий круг
//
//class Circle(val radius: Double): Shape() {
//// Переопределите метод calculate Area(), чтобы он возвращал площадь круга
//}
//// Подкласс Rectangle, представляющий прямоугольник
//class Rectangle(val width: Double, val height: Double): Shape() { // Переопределите метод calculate Area(), чтобы он возвращал площадь прямоугольника
//}
//fun main() {
//// Создайте экземпляр круга и прямоугольника
//// Выведите площади фигур
//}